app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'diretor'
---
  def find_by_same_director
    debugger
    @movie = Movie.find(params[:id])
    if @movie.director != nil && @movie.director != "" then
      @movies = Movie.find_all_by_director (Movie.find(params[:id]).director)